
#Область ОбработчикиСобытийФормы
#КонецОбласти


//////////////////////////////////////////


#Область ОбработчикиСобытийЭлементовФормы    


#КонецОбласти


//////////////////////////////////////////


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИзменения(Команда)    
	
	ПрименитьИзмененияНаСервере();
	Сообщить("Обработка завершена");
	
КонецПроцедуры

#КонецОбласти


//////////////////////////////////////////


#Область СлужебныеПроцедурыИФункции   

&НаСервере
Функция ПрименитьИзмененияНаСервере()   

	Для каждого Товар Из Товары Цикл		 
		КлючЗаписи = КлючЗаписиНоменклатуры();
		ПараметрыЗаписи = ПустыеПараметрыТоварногоОграничения();
		
		ЗаполнитьПараметры(Товар, КлючЗаписи, ПараметрыЗаписи);

		Попытка
			РегистрыСведений.ТоварныеОграничения.ДобавитьПоддержаниеЗапасаРасчетПоНорме(КлючЗаписи, 
			ПараметрыЗаписи);
		Исключение
			Сообщить("Ошибка записи Номенклатуры: " + Товар.Номенклатура);
		КонецПопытки;
		
	КонецЦикла;	
КонецФункции    

&НаСервере
Процедура ЗаполнитьПараметры(Товар, КлючЗаписи, ПараметрыЗаписи)
	
	КлючЗаписи.Номенклатура = Товар.Номенклатура;
	КлючЗаписи.Склад = Объект.Магазин;
	
	ПараметрыЗаписи.НормаПотребления = Товар.НормаПотребления; 
	ПараметрыЗаписи.СтраховоеКоличествоЗапаса = Товар.СтраховойЗапас;
	ПараметрыЗаписи.ОбеспечениеЗаказовПриПоддержанииЗапаса = Перечисления.
		ОбеспечениеЗаказовПриПоддержанииЗапаса.ЗаСчетЗапасов; 
КонецПроцедуры

// Функция-конструктор структуры, описывающей параметры товарных ограничений.
//
// Возвращаемое значение:
//		Структура - Структура с полями:
//			МетодОбеспеченияПотребностей			- Перечисление.МетодыОбеспеченияПотребностей.
//			МинимальноеКоличествоЗапаса				- Число.
//			МаксимальноеКоличествоЗапаса			- Число.
//			СтраховоеКоличествоЗапаса				- Число.
//			НормаПотребления						- Число.
//			ОбеспечениеЗаказовПриПоддержанииЗапаса	- Перечисление.ОбеспечениеЗаказовПриПоддержанииЗапаса.
//
Функция ПустыеПараметрыТоварногоОграничения()
	ПараметрыТоварногоОграничения = Новый Структура();
	ПараметрыТоварногоОграничения.Вставить("МетодОбеспеченияПотребностей",
		Перечисления.МетодыОбеспеченияПотребностей.ПустаяСсылка());
	ПараметрыТоварногоОграничения.Вставить("МинимальноеКоличествоЗапаса",	0);
	ПараметрыТоварногоОграничения.Вставить("МаксимальноеКоличествоЗапаса",	0);
	ПараметрыТоварногоОграничения.Вставить("СтраховоеКоличествоЗапаса",		0);
	ПараметрыТоварногоОграничения.Вставить("НормаПотребления",				0);
	ПараметрыТоварногоОграничения.Вставить("ОбеспечениеЗаказовПриПоддержанииЗапаса",
		Перечисления.ОбеспечениеЗаказовПриПоддержанииЗапаса.ПустаяСсылка());

	Возврат ПараметрыТоварногоОграничения;
КонецФункции

// Функция-конструктор структуры, описывающей запись номенклатуры (общая настройка для всех характеристик) в регистре.
//
// Возвращаемое значение:
//		Структура - Структура с полями:
//			ТипКлюча		- Строка - Служебный реквизит.
//			Номенклатура	- СправочникСсылка.Номенклатура.
//			Склад			- СправочникСсылка.Склады.
//
Функция КлючЗаписиНоменклатуры()
	Ключ = Новый Структура;
	Ключ.Вставить("ТипКлюча",		"ОбщаяНастройка");
	Ключ.Вставить("Номенклатура",	Справочники.ГруппировкиТоварныхОграничений.ПустаяСсылка());
	Ключ.Вставить("Склад",			Справочники.Склады.ПустаяСсылка());
	Возврат Ключ;
КонецФункции


#КонецОбласти






